--npc_name=
--{
--"¾¸ÈË",
--"Ñ©Ñı",
--"´óõàÈË",
--"±±º£ÅÑ¾ü",
--"±ù½¾³æ",
--"Ì¦Ñı",
--"¿ñÄñ",
--"»·¹·",
--"Ñ©Ô­¾ŞÊŞ",
--"²İÏÉ",
--"¹Æµñ",
--"ÏÄ¸ûÊ¬",
--"ºìÉ·",
--"¼×¿ÇÈË",
--"Ê¬»È",
--"¹íÔ¦",
--"ÌìÎâ",
--"É³»ê",
--"ºÚÉ··ä",
--"ÎäÊ¿¹ê",
--"µ¶Çİ",
--"»ğÓã",
--"»ğÀëĞ¡Ñı",
--"¾úÈË",
--"ºµ¹ê",
--"»ÄÖí",
--"Ìú¿øÓã",
--"±ùÁé",
--"ÑÒ½¬ÊŞ",
--"Ó¢ÕĞÉñ",
--"¾ŞÊ¯Éñ",
--"Ë®²Î",
--"·É¼×",
--"ÏÄ¸ûÊ¬Íõ",
--"ÃÀÅ®°ö",
--"»ğĞ°",
--"ÏºÈË",
--"¹íµÆ",
--"¿ªÃ÷Éñ",
--"Á×Ñı",
--"³¤³ËÉñ",
--"À×ÔóÉñ",
--"Ò°Ã«Éñ",
--"ÎäÂŞÉñ",
--"ËÀÁé",
--"ÏàÁøÉñ",
--"»Ã¾«",
--"»ÃÁé",
--"Éİ±È·òÈË",
--"Â½Îá´óÉñ",
--"·ÉÊó",
--"²¢·â",
--"ÙÁÈË",
--"Ç¿»¯Ê¬»È",
--"Ç¿»¯·É¼×",
--"Ç¿»¯ÃÀÅ®°ö",
--"Ç¿»¯Ò°Ã«Éñ",
--"Ç¿»¯ËÀÁé",
--"Ç¿»¯»Ã¾«",
--"Ç¿»¯Éİ±È·òÈË",
--"Ç¿»¯Â½Îá´óÉñ",
--}
--
--mapname = {
--		[1]="·âÉñÌ¨",
--		[2]="³ç³Ç´óÓª",
--		[3]="ÓñĞé¹¬",
--		[4]="ò¿ÓÈÄ¹",
--		[5]="³ç³ÇÒ°Íâ",
--		[6]="±±º£",
--		[7]="ÑàÉ½",
--		[8]="À¥ÂØÉ½Â´",
--		[9]="Î÷À¥ÂØ",
--		[10]="Ê×ÑôÉ½",
--		[11]="ÓÎ»ê¹Ø",
--		[12]="Ãç½®",
--		[13]="¾ŞÂ¹",
--		[14]="äü¹Ø",
--		[15]="ÃÏ½ò",
--		[16]="ÈıÉ½¹Ø",
--		[17]="áªÉ½",
--		[18]="ÄÁÒ°",
--		[19]="¾øÁúÁë",
--		[20]="Î÷áª",
--		[21]="³¯¸è",
--		[22]="»ÄÄ®",
--		[23]="É³Ä®ÍÁ³Ç",
--		[24]="É³Ä®·çÌ²",
--		[25]="É³Ä®ÂÌÖŞ",
--		[26]="ËÀÍöÉ³Ä®",
--		[27]="ĞùÔ¯¶´Ò»²ã",
--		[28]="ĞùÔ¯¶´¶ş²ã",
--		[29]="ĞùÔ¯¶´Èı²ã",
--		[30]="ĞùÔ¯¶´ËÄ²ã",
--		[31]="ĞùÔ¯¶´Îå²ã",
--		[32]="ÓñÈª±ù´¨",
--		[33]="±ù´¨Ñ©¹È",
--		[34]="´ó·ç±ù´¨",
--		[35]="´óÔó±ù´¨",
--		[36]="±ù´¨Ö®¼«",
--		[37]="¶«º£Ë®Óò",
--		[38]="¶«º£º£µ×",
--		[39]="¶«º£º£¹µ",
--		[40]="¶«º£ÁúÓò",
--		[41]="¶«º£ÁúÔ¨",
--		[42]="±ÌÓÎ¹¬Ò»²ã",
--		[43]="±ÌÓÎ¹¬¶ş²ã",
--		[44]="±ÌÓÎ¹¬Èı²ã",
--		[45]="±ÌÓÎ¹¬ËÄ²ã",
--		[46]="±ÌÓÎ¹¬Îå²ã",
--		[47]="À¦ÏÉ¹¬Ò»²ã",
--		[48]="À¦ÏÉ¹¬¶ş²ã",
--		[49]="À¦ÏÉ¹¬Èı²ã",
--		[50]="À¦ÏÉ¹¬ËÄ²ã",
--		[51]="À¦ÏÉ¹¬Îå²ã",
--			[52]="Ñş³Ø",
--			[53]="´óº£",			--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[54]="ÅîÀ³",			--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[55]="¶«å­",			--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[56]="·½ÕÉ",			--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[57]="¿ó³¡",			--¿ó³¡
----            [58]="Ò©Íõ¹È",
----            [59]="³ç³Ç¿ó³¡",
--			[60]="ÌìÀÎ",			--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[61]="10ÄêÇ°ÓñĞé¹¬",		--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[62]="10ÄêºóÓñĞé¹¬",	
--			[63]="10Äêºó³¯¸è",	
--			[64]="2000ÄêÇ°¹ÅÕ½³¡",		--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[65]="³ÂÌÁ¹Ø",
--			[66]="Öí³Ş³ÇÕ¯",		--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[67]="ÍòÏÉÕó£¨ÍÁ£©",		--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[68]="ÍòÏÉÕó£¨Ë®£©",		--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[69]="ÍòÏÉÕó£¨»ğ£©",		--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[70]="ÍòÏÉÕó£¨·ç£©",		--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[71]="ÉÌÖÜÕ½³¡",		--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[72]="¿ªÃ÷µº",			--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[73]="²»ÖÜÌì¹Ø",
--			[74]="²»ÖÜÉ½",
--			[75]="Óü·¨É½",
--			[76]="ÚæÈªÊ¥µØ",
--			[77]="Á÷²¨É½",
--			[78]="¿ÕÉ£ÁéÉ½",
----            [92]="ÌìÀÎ",            --ÎŞ´ËµØÍ¼
----            [93]="ÌìÀÎ",
----            [94]="ÌìÀÎ",
----            [95]="ÌìÀÎ",
----            [96]="ÌìÀÎ",
--			[97]="ÑÖÂŞµî",			--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[98]="»ÆÈª¸®",			--²»ÄÜÊ¹ÓÃÖ¸ÄÏÖé
--			[99]="ÄÏ¿Â¿¤"
--		}

NpcChr_idx = { [0] = 15, [1] = 17, [2] = 16, [3] = 21, [4] = 18, [5] = 20, [6] = 19, [7] = 19 } --À¶¹ÖµôØÔ ÊôĞÔºÅ¶ÔÓ¦ØÔË÷Òı
function OnDeath(npcindex)
    --¸÷Àà°´µØÍ¼×é¶Ó¹²Ïí³É¹ûµÄÈÎÎñ
    local w, x, y = GetWorldPos() --Íæ¼ÒµØÍ¼¼°×ø±ê
    local mapgid, px, py = GetNpcWorldPos(npcindex) --npcµØÍ¼¼°×ø±ê
    if (w ~= mapgid) then
        return 0
    end

    local npcchr = GetHardNpcAttrib(npcindex)--À¶¹ÖÊôĞÔ
    local mob_lvl = GetNpcLevel(npcindex) --¹ÖÎïµÈ¼¶
    -------------------------ÒÔÉÏÎª¹²ÏíµÄ±äÁ¿ ½ûÖ¹ÖØĞÂ¸³Öµ----------------------
    if (npcchr >= 0) and (npcchr <= 7) then
        local i = GetLevel() - mob_lvl
        if (i <= 10) then
            ThrowItem(npcindex, PlayerIndex, 3, NpcChr_idx[npcchr], 0, 1, 0, 0) --µôØÔ
            if (mob_lvl >= 15) then
                --µ±·Å²Ö¿â¶à¸øÊ± ,ÎïÆ·ÎŞÒâÒå,
                if (GetBit(GetTask(Task_hengcai), 1) == 0 and HaveNormalItem(6, 1, 358, 1) == 0) then
                    AddNormalItem(6, 1, 358, 1, 0, 0)
                    TopMessage("B¹n nhËn ®­îc 1 <c=yel>Viªn Bån<c>")
                    Msg2Player("B¹n bÊt ngê nhËn ®­îc 1 <cViªn Bån")
                end ;
            end ;
        end ;
    end ;
end

function no()
    CloseDialog()
end;