--buff645.lua
--author:laiyongcong
--date:2009-4-22

-----------³õÏÖ¶ËÄß ÈýÓãÖ®ÂÒ¡¢»ðÀëÐ¡Ñý¡¢±³ºóÖ÷Ä±-----------------
Task_Variety_Process = 1389        --1byte: 0Ã»ÁìÈÎÎñ£¬1ÁìÁËÈÎÎñ 2ÔÚÐÇ¹Ù´¦ÁìÈ¡ÁË½±Àø 3ÁìÈ¡ÁËÌ½ÖªÉ³»êµÄÈÎÎñ 4³É¹¦Óëµ¥´¿É³»ê¶Ô»° 5ÔÚ»ÆÌì»¯´¦ÁìÈ¡ÁË½±Àø
--6ÁìÈ¡ÁËÉ±ÈýÓãµÄÈÎÎñ  7ÓëÒ½Éú¶Ô»° 8Óë´óÍ·Óã¶Ô»° 9ÓëÕÛÂÞÓã¶Ô»° 10Óë¾Þ¹ÇÉàÓã¶Ô»° 11ÔÚ»ÆÌì»¯´¦½±Àø

--12¼ûÍê×£ÈÚ£¬13É±Íê15¸ö»ðÀëÐ¡Ñý£¬14µÃµ½»ê²¯£¬15×£ÈÚÔÄ¶Á¼ÇÒäºó£¬16ÁìÈ¡»ÆÌì»¯½±Àø    -----»ðÀë¾«ÆÇ

--2byte: 1½Óµ½¹ý³õ¼û¶ËÄßµÄÍ¨Öª 2½Óµ½¹ýÈýÓãÖ®ÂÒµÄÍ¨Öª 3½Óµ½¹ý»ðÀë¾«ÆÇµÄÍ¨Öª 4 ½Óµ½¹ý±³ºóÖ÷Ä±µÄÍ¨Öª
--3byte£º±¾´ÎÉ±ËÀ»ðÀëÐ¡ÑýµÄÊýÄ¿
--4Byte:±¾´ÎÉ±ËÀ¾úÈËµÄÊýÄ¿

---------------------±³ºóÖ÷Ä±-----------------

function main()
    if (GetTaskByte(Task_Variety_Process, 1) < 20) then
        --ÔÚÉ±ËÀ±ùÁéÊ×ÁìÖ®Ç°ÏûÊ§
        Talk(1, "no", "Tr¹ng th¸i DÉn L«i QuyÕt biÕn mÊt, kh«ng t×m ®­îc manh mèi tõ B¨ng Linh thñ lÜnh, trë vÒ t×m Kh­¬ng Tö Nha gióp ®ì.")
        Msg2Player("DÉn L«i QuyÕt ®· hÕt hiÖu lùc, cÇn t×m Kh­¬ng Tö Nha gióp ®ì.")
        TaskNote(1047, 10)
    end
end

function no()
    CloseDialog()
end;
