--±ùÁé¼ÒÊé.lua
--author: Gaojingwei
--date: 2009/03/25

Task_Variety_Process = 1389        --1byte: 0Ã»ÁìÈÎÎñ£¬1ÁìÁËÈÎÎñ 2ÔÚÐÇ¹Ù´¦ÁìÈ¡ÁË½±Àø 3ÁìÈ¡ÁËÌ½ÖªÉ³»êµÄÈÎÎñ 4³É¹¦Óëµ¥´¿É³»ê¶Ô»° 5ÔÚ»ÆÌì»¯´¦ÁìÈ¡ÁË½±Àø
--6ÁìÈ¡ÁËÉ±ÈýÓãµÄÈÎÎñ  7ÓëÒ½Éú¶Ô»° 8Óë´óÍ·Óã¶Ô»° 9ÓëÕÛÂÞÓã¶Ô»° 10Óë¾Þ¹ÇÉàÓã¶Ô»° 11ÔÚ»ÆÌì»¯´¦½±Àø

--12¼ûÍê×£ÈÚ£¬13É±Íê15¸ö»ðÀëÐ¡Ñý£¬14µÃµ½½õ²¯£¬15×£ÈÚÔÄ¶Á¼ÇÒäºó£¬16ÁìÈ¡»ÆÌì»¯½±Àø    -----»ðÀë¾«ÆÇ

--2byte: 1½Óµ½¹ý³õ¼û¶ËÄßµÄÍ¨Öª 2½Óµ½¹ýÈýÓãÖ®ÂÒµÄÍ¨Öª 3½Óµ½¹ý»ðÀë¾«ÆÇµÄÍ¨Öª 4 ½Óµ½¹ý±³ºóÖ÷Ä±µÄÍ¨Öª
--3byte£º±¾´ÎÉ±ËÀ»ðÀëÐ¡ÑýµÄÊýÄ¿
--4Byte:±¾´ÎÉ±ËÀ¾úÈËµÄÊýÄ¿

function no()
    CloseDialog()
end;
function main()
    Talk(1, "no", "#@#@#@#%……Ch÷ ë trªn kh«ng thÓ ®äc, §¹i phu b¶n ®Þa ®· hµnh y ë ®©y nhiÒu n¨m cã lÏ biÕt trªn ®ã viÕt g×.")
    SetTaskByte(Task_Variety_Process, 1, 21) --Íê³ÉÁËÉ±±ùÁéÊ×ÁìµÄÈÎÎñ
    TaskNote(1047, 8)
end
